# ZoneCalculatedSupplyAirflowParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZoneCalculatedSupplyAirflowParam Property
ParameterTypeId Class See Also
---
"Calculated Supply Airflow"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZoneCalculatedSupplyAirflowParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneCalculatedSupplyAirflowParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZoneCalculatedSupplyAirflowParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace